IdeaRS.OpenModel.Material.ConcFireDiagramType
Concrete stress-strain diagram for fire

IdeaRS.OpenModel.Material.ConcFireDiagramType.ByCodeWithAutomaticTemperature
By the code with automatic temperature type

IdeaRS.OpenModel.Material.ConcFireDiagramType.ByCodeWithFixedTemperature
By the code with fixed temperature type